<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class LGDSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $lgdList = "
            3135,බෙන්තොට ප්‍රාදේශීය සභාව
            3134,බලපිටිය ප්‍රාදේශීය සභාව
            3140,කරන්දෙණිය ප්‍රාදේශීය සභාව
            3137,ඇල්පිටිය ප්‍රාදේශීය සභාව
            3143,නියගම ප්‍රාදේශීය සභාව
            3144,තවලම ප්‍රාදේශීය සභාව
            3142,නෙළුව ප්‍රාදේශීය සභාව
            3141,නාගොඩ ප්‍රාදේශීය සභාව
            3133,බද්දේගම ප්‍රාදේශීය සභාව
            3147,වැලිවිටිය-දිවිතුර ප්‍රාදේශීය සභාව
            3121,අම්බලන්ගොඩ නගර සභාව
            3132,අම්බලන්ගොඩ ප්‍රාදේශීය සභාව
            3139,රාජ්ගම ප්‍රාදේශීය සභාව
            3122,හික්කඩුව නගර සභාව
            3136,බෝපේ-පෝද්දල ප්‍රාදේශීය සභාව
            3111,ගාල්ල මහ නගර සභාව
            3131,අක්මීමන ප්‍රාදේශීය සභාව
            3145,යක්කලමුල්ල ප්‍රාදේශීය සභාව
            3146,ඉමදුව ප්‍රාදේශීය සභාව
            3138,හබරදුව ප්‍රාදේශීය සභාව
            3243,පිටබැද්දර ප්‍රාදේශීය සභාව
            3236,කොටපොළ ප්‍රාදේශීය සභාව
            3240,පාස්ගොඩ ප්‍රාදේශීය සභාව
            3239,මුලටියාන ප්‍රාදේශීය සභාව
            3244,අතුරලිය ප්‍රාදේශීය සභාව
            3231,අකුරැස්ස ප්‍රාදේශීය සභාව
            3242,වැලිගම ප්‍රාදේශීය සභාව
            3237,මාලිම්බඩ ප්‍රාදේශීය සභාව
            3235,කඹුරුපිටිය ප්‍රාදේශීය සභාව
            3234,හක්මන ප්‍රාදේශීය සභාව
            3245,කිරිඳි පුහුල්වැල්ල ප්‍රාදේශීය සභාව
            3221,වැලිගම නගර සභාව
            3238,මාතර ප්‍රාදේශීය සභාව
            3211,මාතර මහ නගර සභාව
            3232,දෙවිනුවර ප්‍රාදේශීය සභාව
            3233,දික්වැල්ල ප්‍රාදේශීය සභාව
            3340,සූරියවැව ප්‍රාදේශීය සභාව
            3336,ලුණුගම්වෙහෙර ප්‍රාදේශීය සභාව
            3338,තිස්සමහාරාම ප්‍රාදේශීය සභාව
            3334,හම්බන්තොට ප්‍රාදේශීය සභාව
            3311,හම්බන්තොට මහ නගර සභාව
            3331,අම්බලන්තොට ප්‍රාදේශීය සභාව
            3332,අඟුණුකොළපැලැස්ස ප්‍රාදේශීය සභාව
            3339,වීරකැටිය ප්‍රාදේශීය සභාව
            3335,කටුවන ප්‍රාදේශීය සභාව
            3333,බෙලිඅත්ත ප්‍රාදේශීය සභාව
            3337,තංගල්ල ප්‍රාදේශීය සභාව
            3321,තංගල්ල නගර සභාව
        ";

        $lgdLines = explode("\n", trim($lgdList));
        foreach ($lgdLines as $line) {
            $parts = explode(',', trim($line));
            if (count($parts) === 2) {
                DB::table('local_government_divisions')->insert([
                    'lgd_uid' => trim($parts[0]),
                    'lgd_name' => trim($parts[1]),
                ]);
            }
        }
    }
}
